
AADNonInteractiveUserSignInLogs
| where UserPrincipalName contains ""
| where TimeGenerated > ago(24d)
| summarize count() by Location, UserPrincipalName, UserAgent

SigninLogs
| where UserPrincipalName contains ""
| project TimeGenerated, ResultType, AlternateSignInName, AuthenticationDetails, AuthenticationRequirement, ClientAppUsed, UserAgent, IPAddress, Location

//filter based on location and resulttype
| where Location <> "<location>"
| where ResultType == "<xxxxxx>" //0 is success, XXXXX is failed, etc.


// searching for noninteractive signin history with resulttype+CA-status
AADNonInteractiveUserSignInLogs
| where UserPrincipalName == <UPN>
| project ResultType, ConditionalAccessStatus, IPAddress, TimeGenerated, ResultDescription, UserPrincipalName