
AADNonInteractiveUserSignInLogs
| where UserPrincipalName contains ""
| where TimeGenerated > ago(24d)
| summarize count() by Location, UserPrincipalName, UserAgent

SigninLogs
| where UserPrincipalName contains ""
| project TimeGenerated, ResultType, AlternateSignInName, AuthenticationDetails, AuthenticationRequirement, ClientAppUsed, UserAgent, IPAddress, Location
