//add member to role
AuditLogs
| where OperationName == "Add member to role"
| where TargetResources contains "name"

//Change user password
AuditLogs
| where OperationName == "Change user password"
| where TargetResources conatins "name"


//searching for specific <operationname> with initiated user and target user
AuditLogs
| where OperationName == "<opname>"
| project TargetResources[2].userPrincipalName, parse_json(tostring(InitiatedBy.user)).userPrincipalName, OperationName, TimeGenerated

//searching for <OperationName> on a specific source-identity
AuditLogs
| where Identity contains "Gullin"
| project TargetResources[2].userPrincipalName, parse_json(tostring(InitiatedBy.user)).userPrincipalName, OperationName, TimeGenerated


#User added to Azure Active Directory Privileged Groups

AuditLogs
| where OperationName == "Add member to role"
| project TimeGenerated, Result, OperationName, parse_json(tostring(InitiatedBy.user)).userPrincipalName, parse_json(tostring(InitiatedBy.user)).ipAddress, TargetResources[0].userPrincipalName

